app/controllers/posts_controller.rb

	def create
		@post = Post.new(params[:post])
		#@post = Post.new(params.require(:post).permit(:title, :content))
		if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hahahaha"], ["created_at", Fri, 23 Oct 2015 07:11:25 UTC +00:00], ["title", "user"], ["updated_at", Fri, 23 Oct 2015 07:11:25 UTC +00:00]]

	def update
		@post = Post.find(params[:id])
		if @post.update_attributes!(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "posts" SET "title" = 'NEMURISAMA', "content" = 'NEMURISAMA GA SUKI DESU', "updated_at" = '2015-11-03 15:53:18.283417' WHERE "posts"."id" = 4